      {
        "title": "1. Grant of License",
        "content": "The licensor grants you a limited, non-exclusive, non-transferable, and revocable license to use the software in accordance with the terms of this agreement."
      },
      {
        "title": "2. Restrictions",
        "content": "You may not modify, reverse engineer, decompile, or disassemble the software, nor attempt to derive the source code of the software, unless explicitly permitted by applicable law."
      },
      {
        "title": "3. Intellectual Property Rights",
        "content": "The software and any copies that you are authorized to make are the intellectual property of the licensor. The structure, organization, and code of the software are valuable trade secrets of the licensor."
      },
      {
        "title": "4. Termination",
        "content": "This license is effective until terminated. Your rights under this license will terminate automatically if you fail to comply with any terms of this agreement. Upon termination, you must stop using the software and destroy all copies in your possession."
      },
      {
        "title": "5. Disclaimer of Warranties",
        "content": "The software is provided 'as is' without warranties of any kind, either express or implied, including but not limited to the implied warranties of merchantability, fitness for a particular purpose, or non-infringement."
      },
      {
        "title": "6. Limitation of Liability",
        "content": "In no event will the licensor be liable for any direct, indirect, incidental, special, or consequential damages arising out of the use of or inability to use the software, even if the licensor has been advised of the possibility of such damages."
      },
      {
        "title": "7. Governing Law",
        "content": "This agreement shall be governed by and construed in accordance with the laws of [Your Jurisdiction], without regard to its conflict of law principles."
      },
      {
        "title": "8. Entire Agreement",
        "content": "This agreement constitutes the entire agreement between you and the licensor and supersedes any prior agreements regarding the subject matter herein."
      },
      {
        "title": "9. Severability",
        "content": "If any provision of this agreement is found to be invalid or unenforceable, the remaining provisions will remain in full force and effect."
      },
      {
        "title": "10. Contact Information",
        "content": "For questions about this license agreement, please contact [Contact Information]."
      }
